Revit 2027 API
ReferencePoint.Name Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
abstract Name : string with get, set
override Name : string with get, set
Property Value
String
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace